using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace CareerOrientation.Data.Migrations
{
    /// <inheritdoc />
    public partial class AddSampleData : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Courses",
                columns: new[] { "CourseId", "Description", "Name", "Semester", "TrackId" },
                values: new object[,]
                {
                    { 1, "Το μάθημα \"Λογική Σχεδίαση Ψηφιακών Συστημάτων\" εξετάζει τη σχεδίαση και λειτουργία των ψηφιακών συστημάτων. Καλύπτει θέματα όπως το δυαδικό σύστημα αρίθμησης, άλγεβρα Boole και εφαρμογές της, αριθμητικά κυκλώματα, σύγχρονα ακολουθιακά κυκλώματα , μηχα-νές καταστάσεων, μονάδες μνήμης, ψηφιακά ολοκληρωμένα κυκλώματα, προσομοίωση κυκλωμάτων και γλώσσες περιγραφής υλικού.", "ΛΟΓΙΚΗ ΣΧΕΔΙΑΣΗ ΨΗΦΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ", 1, null },
                    { 2, "Το μάθημα \"Μαθηματικά των υπολογιστών\" παρέχει μια εισαγωγή στη θεωρία συνόλων και βασικών αρχών των μαθηματικών, όπως η μαθηματική επαγωγή, αρχή εγκλεισμού – αποκλεισμού, αρχή του Περιστερεώνα και αρχή της διαγωνιοποίησης. Περιλαμβάνει, επίσης, τη μα-θηματική λογική, την άλγεβρα Boole, τη συνδυαστική ανάλυση, τις διαφορές και τα αθροίσματα, καθώς και στοιχεία της θεωρίας αριθμών.", "ΜΑΘΗΜΑΤΙΚΑ ΤΩΝ ΥΠΟΛΟΓΙΣΤΩΝ", 1, null },
                    { 3, "Στο μάθημα αυτό περιγράφονται με εισαγωγικό, αλλά πλήρη, τρόπο οι τεχνολογίες και τα πρωτόκολλα πάνω στα οποία στηρίζονται το Διαδίκτυο και ο Παγκόσμιος Ιστός και αναλύονται με περισσότερη λεπτομέρεια η ανάπτυξη εφαρμογών με τη χρήση συγκεκριμένων εργαλεί-ων/γλωσσών, οι οποίες εκτελούνται στην πλευρά του πελάτη ή/και στην πλευρά του εξυπηρετητή. Μερικές από τις έννοιες οι οποίες αντιμετωπίζονται είναι: στοίβα πρωτοκόλλων TCP/IP, επίπεδο μεταφοράς και διαδικτύου, HTML5, CSS3, Javascript, jQuery, κλήση AJAX, PHP nodejs, XML και JSON.", "ΤΕΧΝΟΛΟΓΙΕΣ ΔΙΑΔΙΚΤΥΟΥ", 1, null },
                    { 4, "Το μάθημα \"Εισαγωγή στην Επιστήμη των Υπολογιστών\" προσφέρει μια εισαγωγή στις βασικές αρχές και τις έννοιες της επιστήμης των υπολογιστών. Περιλαμβάνει θέματα όπως η αναπαράσταση και κωδικοποίηση δεδομένων, η άλγεβρα Boole, αλγορίθμους, βασικές αρχές των λειτουργικών συστημάτων, γλώσσες προγραμματισμού, δομές δεδομένων, σφάλματα και εξαι-ρέσεις, καθώς και συλλογή δεδομένων από το διαδίκτυο. Αυτά τα θέματα παρέχουν τις βασικές γνώσεις και τις δεξιότητες που απαιτούνται για την κατανόηση και την ανάπτυξη υπολογιστικών συστημάτων και λογισμικού.", "ΕΙΣΑΓΩΓΗ ΣΤΗΝ ΕΠΙΣΤΗΜΗ ΤΩΝ ΥΠΟΛΟΓΙΣΤΩΝ", 1, null },
                    { 5, "Το μάθημα \"Διακριτά Μαθηματικά\" παρέχει μια εισαγωγή σε διάφορα θέματα των διακριτών μαθηματικών. Οι κύριοι τομείς που καλύπτονται είναι η θεωρία γραφημάτων και οι εφαρμογές της στους αλγόριθμους, οι γεννήτριες συναρτήσεις, οι αναγωγικές εξισώσεις, οι ασυμπτωτικές εκτιμήσεις, οι γλώσσες και αυτόματα. ", "ΔΙΑΚΡΙΤΑ ΜΑΘΗΜΑΤΙΚΑ", 1, null },
                    { 6, "Το αντικείμενο του μαθήματος είναι η μελέτη των βασικών δομών δεδομένων που χρησιμοποιούνται στην ανάπτυξη αλγορίθμων. Έμφαση δίνεται στο χρόνο εκτέλεσης των βασικών λειτουργιών των δομών δεδομένων και στον αναλυτικό προσδιορισμό του πλήθους των βασικών εντολών που απαιτούνται για την ολοκλήρωσή τους. Συγκεκριμένα, παρουσιάζονται οι δομές του πίνακα, της διασυνδεδεμένης λίστας, της στοίβας, της ουράς, του σωρού, των δυαδικών δέντρων αναζήτησης. Επίσης, παρουσιάζονται η τεχνική του κατακερματισμού (hashing), τα ισοζυγισμένα δέντρα αναζήτησης (AVL, Red-Black και Β-δέντρα) καθώς και βασικοί αλγόριθμοι ταξινόμησης", "ΔΟΜΕΣ ΔΕΔΟΜΕΝΩΝ", 2, null },
                    { 7, "ΤΑντικείμενο του μαθήματος είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού JAVA. Καλύπτει βασικές αρχές τις όπως βασι-κές δομές, κληρονομικότητα, πολυμορφισμός, ενθυλάκωση, ειδικές κλάσεις, εξαιρέσεις, ειδικά θέματα, βιβλιοθήκες, διαπροσωπίες, προσπέλαση αρχείων, access modifiers, non-access modifiers. (hashing), τα ισοζυγισμένα δέντρα αναζήτησης (AVL, Red-Black και Β-δέντρα) καθώς και αλγόριθμοι ταξινόμησης.", "ΑΝΤΙΚΕΙΜΕΝΟΣΤΡΕΦΗΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ", 2, null },
                    { 8, "Το μάθημα \"Αρχιτεκτονική Υπολογιστών\" εστιάζει στην οργάνωση, τη σχεδίαση και την τεχνο-λογία των υπολογιστών. Παρουσιάζει την αρχιτεκτονική συνόλου εντολών, περιλαμβάνοντας τους καταχωρητές, τις εντολές και τους τρόπους διευθυνσιοδότησης. Επίσης, μελετά τη γλώσ-σα μηχανής, τη συμβολική γλώσσα (Assembly) και τους συμβολομεταφραστές (Assemblers). Τέλος, στο μάθημα αναλύονται οι αριθμητικές πτυχές των υπολογιστών, όπως η αναπαράστα-ση ακεραίων αριθμών και αριθμών κινητής υποδιαστολής.", "ΑΡΧΙΤΕΚΤΟΝΙΚΗ ΥΠΟΛΟΓΙΣΤΩΝ", 2, null },
                    { 9, "Το μάθημα εντάσσεται στο επιστημονικό πεδίο της επιχειρησιακής έρευνας. Αναφέρεται σε μία από τις βασικές τεχνικές βελτιστοποίησης της επιχειρηματικής έρευνας, τον γραμμικό προγραμματισμό, ο οποίος προσφέρει την μεθοδολογική προσέγγιση και το πλαίσιο επίλυσης πολ-λών προβλημάτων της οργάνωσης και της διοίκησης.", "ΜΑΘΗΜΑΤΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ", 3, null },
                    { 10, "Το αντικείμενο του μαθήματος είναι η ανάπτυξη εφαρμογών αντικειμενοστρεφούς μοντέλου ανάπτυξης λογισμικού. Στο πλαίσιο του μαθήματος δίνεται ιδιαίτερη έμφαση στα εργαλεία α-νάπτυξης εφαρμογών, ολοκληρωμένα περιβάλλοντα ανάπτυξης (IDEs). Με τη χρήση του Visual Studio και της C# ως γλώσσας προγραμματισμού, οι φοιτητές μαθαίνουν να αναπτύσσουν desktop, web, ή/και mobile εφαρμογές, γρήγορα, αποδοτικά και κυρίως με την όσο το δυνατόν μικρότερη πιθανότητα να κάνουν λάθη προγραμματισμού ή/και λογικής", "ΑΝΤΙΚΕΙΜΕΝΟΣΤΡΕΦΗΣ ΑΝΑΠΤΥΞΗ ΕΦΑΡΜΟΓΩΝ", 3, null },
                    { 11, "Βασικές έννοιες και αρχές Λειτουργικών Συστημάτων. Αρχιτεκτονική, δομή και κατηγοριοποίηση Λειτουργικών Συστημάτων. Διεργασίες, Νήματα. Δια-διεργασιακή επικοι-νωνία. Χρονοδρομολόγηση της CPU. Σύστημα μνήμης. Διαχείριση μνήμης. Εικονική Μνήμη. Σελιδοποίηση. Αλγόριθμοι διαχείρισης μνήμης. Διαχείριση Αρχείων και καταλόγων. Συστήματα Αρχείων. Είσοδος/Έξοδος. Αδιέξοδα.", "ΛΕΙΤΟΥΡΓΙΚΑ ΣΥΣΤΗΜΑΤΑ", 3, null },
                    { 12, "Το μάθημα ασχολείται με τη Θεωρία των Γλωσσών, την κατασκευή αυτομάτων αναγνώρισης λεκτικών μονάδων, αλλά και επιμέρους τμήματα, που αποτελούν τη βάση της δημιουργίας ε-νός μεταγλωττιστή (compiler) μιας γλώσσας προγραμματισμού, την Αναζήτηση, ανάλυση και σύνθεση δεδομένων και πληροφοριών, με τη χρήση και των απαραίτητων τεχνολογιών.", "ΜΕΤΑΓΛΩΤΤΙΣΤΕΣ", 3, null },
                    { 13, "Το μάθημα \"Πιθανότητες και Στατιστική\" παρουσιάζει μια εισαγωγή στις βασικές έννοιες και μεθόδους της πιθανότητας και της στατιστικής. Οι φοιτητές μελετούν πειράματα τύχης, δειγματοχώρους και γεγονότα, και εξετάζουν την αξιωματική θεμελίωση της πιθανότητας. Επίσης, αναλύονται οι πιθανότητες ένωσης γεγονότων, η δεσμευμένη πιθανότητα και η α-νεξαρτησία. Το μάθημα καλύπτει επίσης τις τυχαίες μεταβλητές, τις συναρτήσεις κατανο-μής και πυκνότητας πιθανότητας και τις πολυδιάστατες τυχαίες μεταβλητές. Τέλος, πραγματοποιείται εισαγωγή στην περιγραφική στατιστική, τη στατιστική συμπερασματολογία και τους έλεγχους στατιστικών υποθέσεων.", "ΠΙΘΑΝΟΤΗΤΕΣ ΚΑΙ ΣΤΑΤΙΣΤΙΚΗ", 3, null },
                    { 14, "Το μάθημα \"Δίκτυα Υπολογιστών\" εστιάζει στην ανάλυση και επεξήγηση των βασικών έννοιων, αρχών και πρωτοκόλλων που αφορούν στη δικτύωση. Με έμφαση στα πρωτόκολλα του Διαδικτύου, περι-γράφονται θέματα όπως οι διάφοροι τύποι δικτύων (μεταγωγής, διαδικτύων), η σχεδίαση των δικτύ-ων, η μετάδοση πληροφορίας, οι αλγόριθμοι προσπέλασης σε κοινό μέσο, οι τεχνολογίες μεταγωγής, η διαδικασία δρομολόγησης, η επικοινωνία από άκρο σε άκρο, οι ασύρματες επικοινωνίες και η επίδοση εφαρμογών. Σκοπός είναι η κατανόηση της λειτουργίας και της διαχείρισης των δικτύων υπολογιστών.", "ΔΙΚΤΥΑ ΥΠΟΛΟΓΙΣΤΩΝ ", 4, null },
                    { 15, "Το μάθημα \"Αλγόριθμοι\" επικεντρώνεται στη μελέτη τεχνικών επίλυσης βασικών υπολογιστικών προ-βλημάτων. Εξετάζεται ο σχεδιασμός αποδοτικών τεχνικών επίλυσης για προβλήματα στην Πληροφορική, που συντελούν στην επίλυση άλλων υπολογιστικών προβλημάτων. Επικεντρώνεται στο χρόνο εκτέλεσης των αλγορίθμων και στη μαθηματική ανάλυση τους. Παρουσιάζονται αλγόριθμοι για προβλήματα ταξινόμησης, αναζήτησης, γραφημάτων, αριθμητικών υπολογισμών και εισαγωγή στη Θεωρία Υπολογισμού.", "ΑΛΓΟΡΙΘΜΟΙ", 4, null },
                    { 16, "Το μάθημα \"Βάσεις Δεδομένων\" παρέχει γνώσεις για τον σχεδιασμό και τη χρήση των Βάσεων Δεδομένων (ΒΔ), που αποτελούν κρίσιμο στοιχείο κάθε Πληροφοριακού Συστήματος (ΠΣ). Το περιεχόμενο περιλαμβάνει το θεωρητικό υπόβαθρο με το Σχεσιακό Μοντέλο και τη Σχεσιακή Άλγεβρα, την εκμά-θηση της γλώσσας SQL (το πρότυπο των Συστημάτων Διαχείρισης ΒΔ), τεχνικές σχεδίασης Σχεσιακών ΒΔ με έμφαση στη θεωρία της κανονικοποίησης, καθώς και εργαστηριακές ασκήσεις με το PostgreSQL, ένα δημοφιλές σύστημα διαχείρισης ΒΔ.", "ΒΑΣΕΙΣ ΔΕΔΟΜΕΝΩΝ ", 4, null },
                    { 17, "Το μάθημα \"Προγραμματισμός στο Διαδίκτυο και τον Παγκόσμιο Ιστό\" ασχολείται με τη θεωρητική μελέτη και την πρακτική εξάσκηση σε θέματα προγραμματισμού στο διαδίκτυο και τον παγκόσμιο ιστό. Περιλαμβάνει αρχιτεκτονική πελάτη-εξυπηρετητή, δικτυακό προγραμματισμό, πρωτόκολλο HTTP, υλοποίηση web server, παραλλαγές αρχιτεκτονικής πελάτη-εξυπηρετητή, προγραμματισμό από την πλευρά του εξυπηρετητή (Java servlets) και μόνιμη αποθήκευση δεδομένων σε διαδικτυακές εφαρμογές. Οι φοιτητές εκπαιδεύονται σε τεχνικές που αφορούν την ανάπτυξη και τη λειτουργία των διαδικτυακών εφαρμογών.", "ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΣΤΟ ΔΙΑΔΙΚΤΥΟ ΚΑΙ ΤΟΝ ΠΑΓΚΟΣΜΙΟ ΙΣΤΟ", 4, null },
                    { 18, "Το μάθημα \"Αρχές και Εφαρμογές Σημάτων και Συστημάτων\" εξετάζει τη θεωρία και τις εφαρμογές των σημάτων και των συστημάτων. Αποτελεί θεμελιώδες μάθημα σε προπτυχιακά προγράμματα, συμπεριλαμβανομένων των προγραμμάτων σπουδών στη σύγχρονη Πληροφορική. Παράλληλα, δη-μιουργεί τις βάσεις για εξειδικευμένα τεχνολογικά μαθήματα, όπως Αναγνώριση Προτύπων, Ανάλυση Εικόνας, Τεχνητή Όραση, Τηλεπικοινωνιακά Συστήματα, Δίκτυα Υπολογιστών, Συστήματα Πολυμέσων, Επεξεργασία Φωνής, κ.ά. Οι ενότητες του μαθήματος περιλαμβάνουν ένα εισαγωγικό μέρος για τις έννοιες του σήματος και του συστήματος, μετασχηματισμούς σημάτων, δειγματοληψία και κβά-ντωση σημάτων, γραμμικά αναλλοίωτα συστήματα, συστήματα επικοινωνίας και διαμόρφωση, ψηφιακά συστήματα επικοινωνίας, και το προγραμματιστικό περιβάλλον MATLAB.", "ΑΡΧΕΣ ΚΑΙ ΕΦΑΡΜΟΓΕΣ ΣΗΜΑΤΩΝ ΚΑΙ ΣΥΣΤΗΜΑΤΩΝ", 4, null },
                    { 19, "Το μάθημα \"Αλληλεπίδραση Ανθρώπου και Υπολογιστή\" ασχολείται με τον σχεδιασμό του συστήματος διεπαφής ανθρώπου-υπολογιστή. Μελετά την ανθρώπινη πλευρά της αλληλεπίδρα-σης, εστιάζοντας στις ανάγκες, τις δυνατότητες και τις προκλήσεις που αντιμετωπίζει ο χρή-στης. Εξετάζει τα κλασικά και σύγχρονα μέσα επικοινωνίας του υπολογιστή και αναλύει τα μο-ντέλα αλληλεπίδρασης. Επικεντρώνεται στους στόχους, τις μεθόδους και την ανάλυση εργα-σιών που χρησιμοποιούνται για τον σχεδιασμό αποτελεσματικών συστημάτων διεπαφής. Τέ-λος, το μάθημα αναφέρεται στη χρηστικότητα και τη φιλικότητα του λογισμικού, εξετάζοντας τη σημασία της σχεδίασης διεπαφής που προσφέρει ευκολία στον χρήστη και βελτιώνει την εμπειρία χρήσης.", "ΑΛΛΗΛΕΠΙΔΡΑΣΗ ΑΝΘΡΩΠΟΥ ΚΑΙ ΥΠΟΛΟΓΙΣΤΗ", 5, null },
                    { 20, "Αναγνώριση Προτύπων (pattern recognition) είναι η επιστημονική περιοχή που έχει στόχο την ταξινόμηση αντικειμένων σε κατηγορίες (κλάσεις) και συμπεριλαμβάνει το επιστημονικό πεδίο της Μηχανικής Μάθησης (machine learning). Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις ευρύτερα χρησιμοποιούμενες τεχνικές και μεθοδολο-γίες για προβλήματα αναγνώρισης προτύπων.", "ΑΝΑΓΝΩΡΙΣΗ ΠΡΟΤΥΠΩΝ", 5, null },
                    { 21, "Το μάθημα \"Πληροφοριακά Συστήματα\" εστιάζει στην κατανόηση των πληροφοριακών συστη-μάτων (ΠΣ) από διοικητική, οργανωτική, σχεδιαστική και τεχνική πλευρά. Οι φοιτητές αναλύουν τα συστατικά στοιχεία ενός ΠΣ και μαθαίνουν για τους κυριότερους τύπους ΠΣ που χρησιμο-ποιούνται σήμερα. Μελετούν μεθοδολογίες ανάλυσης απαιτήσεων και μετατροπής τους σε σχεδίαση συστήματος. Επιπλέον, αναπτύσσουν ΠΣ και τα δοκιμάζουν, χρησιμοποιώντας την UML για τη δημιουργία διαφόρων μοντέλων ΠΣ. Αναλύουν περιπτώσεις χρήσης μέσω case studies.", "ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ", 5, null },
                    { 22, "Το μάθημα \"Τεχνητή Νοημοσύνη και Εμπειρα Συστήματα\" παρέχει εισαγωγικές γνώσεις στην τεχνητή νοημοσύνη και τα εμπειρα συστήματα. Οι φοιτητές ασχολούνται με την επίλυση προ-βλημάτων σε επιλεγμένες περιοχές, όπως οι γενετικοί αλγόριθμοι, χρησιμοποιώντας μεθόδους τεχνητής νοημοσύνης. Επιπλέον, αποκτούν βασικές γνώσεις στη μηχανική μάθηση και τα νευ-ρωνικά δίκτυα, που είναι σημαντικά εργαλεία στον τομέα της τεχνητής νοημοσύνης.", "ΤΕΧΝΗΤΗ ΝΟΗΜΟΣΥΝΗ ΚΑΙ ΕΜΠΕΙΡΑ ΣΥΣΤΗΜΑΤΑ", 6, null },
                    { 23, "Το μάθημα \"Τεχνολογία Λογισμικού\" συμβάλλει στην κάλυψη των τεχνολογικών απαιτήσεων μέσω της έκθεσης των φοιτητών σε σύγχρονες τεχνικές μοντελοποίησης λογισμικού, αρχιτε-κτονικό σχεδιασμό και την γλώσσα μοντελοποίησης UML. Τα θέματα που καλύπτονται περι-λαμβάνουν μοντέλα κύκλου ζωής λογισμικού, γλώσσες μοντελοποίησης (UML), προϋπολογι-σμός κόστους λογισμικού, ανάλυση απαιτήσεων, σχεδιασμός, υλοποίηση και γλώσσες προγραμματισμού, καθώς και έλεγχος, συντήρηση και εργαλεία CASE.", "ΤΕΧΝΟΛΟΓΙΑ ΛΟΓΙΣΜΙΚΟΥ ", 6, null },
                    { 46, "Το μάθημα \"Ανάκτηση Πληροφορίας και Αναζήτηση στον Παγκόσμιο Ιστό\" ασχολείται με τις βασικές έννοιες της ανάκτησης πληροφοριών και της αναζήτησης στον Παγκόσμιο Ιστό. Κατά τη διάρκεια του μαθήματος, παρουσιάζονται θέματα όπως η ανάκτηση Boole, το λεξιλόγιο όρων και οι λίστες καταχωρίσεων, η κατασκευή ευρετηρίου, η αξιολόγηση στην ανάκτηση πληροφοριών, η ανάδραση συνάφειας και διεύρυνση ερωτημάτων, οι βασικές αρχές αναζήτησης στον Ιστό, η σταχυολόγηση Ιστού και τα ευρετήρια, καθώς και η ανάλυση συνδέσμων. Αυτές οι έννοιες και τεχνικές αποτελούν τη βάση για την αποτελεσματική αναζήτηση και ανάκτηση πληροφοριών στον Παγκόσμιο Ιστό.", "ΑΝΑΚΤΗΣΗ ΠΛΗΡΟΦΟΡΙΑΣ ΚΑΙ ΑΝΑΖΗΤΗΣΗ ΣΤΟΝ ΠΑΓΚΟΣΜΙΟ ΙΣΤΟ", 7, null }
                });

            migrationBuilder.InsertData(
                table: "Skills",
                columns: new[] { "SkillId", "Name", "Type" },
                values: new object[,]
                {
                    { 1, "Κατανόηση των βασικών εννοιών του σχεδιασμού ψηφιακών συστημάτων και της λειτουργίας τους", 0 },
                    { 2, "Κατανόηση της αναπαράστασης των αριθμών και των δεδομένων στα ψηφιακά συστήματα", 0 },
                    { 3, "Ικανότητα ανάλυσης και βελτίωσης της απόδοσης ενός ψηφιακού κυκλώματος", 0 },
                    { 4, "Εξοικείωση με εργαλεία σχεδίασης και προσομοίωσης ψηφιακών κυκλωμάτων", 0 },
                    { 5, "Προσαρμοστικότητα", 1 },
                    { 6, "Δημιουργική σκέψη", 1 },
                    { 7, "Διαχείριση χρόνου", 1 },
                    { 8, "Επίλυση προβλημάτων", 1 },
                    { 9, "Κριτική σκέψη", 1 },
                    { 10, "Ολοκληρωμένη γνώση των βασικών εννοιών και συμβολισμών που αφορούν τα σύνολα, σχέσεις και απεικονίσεις", 0 },
                    { 11, "Ικανότητα εφαρμογής των βασικών αρχών όπως την αρχή της επαγωγής, την αρχή του περιστερεώνα και την αρχή εγκλεισμού-αποκλεισμού για την επίλυση προβλημάτων", 0 },
                    { 12, "Ολοκληρωμένη γνώση των βασικών στοιχείων και τεχνικών από την θεωρία αριθμών όπως ο αλγόριθμος του Ευκλείδη, το θεώρημα Euler-Fermat και οι εφαρμογές του κ.α.", 0 },
                    { 13, "Κατανόηση των ιδιοτήτων της άλγεβρας Boole και των εφαρμογών της", 0 },
                    { 14, "Λήψη αποφάσεων", 1 },
                    { 15, "Άσκηση κριτικής και αυτοκριτικής", 1 },
                    { 16, "Παραγωγή νέων ερευνητικών ιδεών", 1 },
                    { 17, "Αναγνώριση των βασικών αρχών των πρωτοκόλλων που στηρίζουν το Διαδίκτυο, με έμφαση στο IP και το TCP", 0 },
                    { 18, "Κατανόηση των βασικών χαρακτηριστικών των εφαρμογών του διαδικτύου", 0 },
                    { 19, "Κατανόηση των βασικών τεχνικών και εργαλείων προγραμματισμού και ελέγχου μιας διαδικτυακής εφαρμογής", 0 },
                    { 20, "Ικανότητα αξιοποίησης προγραμματιστικών τεχνικών για αποδοτικότερο σχεδιασμό, βελτιστοποίηση απόδοσης και λειτουργική/αποτελεσματική δημιουργία εφαρμογών", 0 },
                    { 21, "Αυτονομία", 1 },
                    { 22, "Ομαδικότητα", 1 },
                    { 23, "Σχεδιασμός και διαχείριση έργων", 1 },
                    { 24, "Παραγωγή νέων ερευνητικών ιδεών", 1 },
                    { 25, "Δημιουργική σκέψη", 1 },
                    { 26, "Ηθική εργασίας", 1 },
                    { 27, "Συμβιβασμός", 1 },
                    { 28, "Επικοινωνία", 1 },
                    { 29, "Προσδιορισμός των βασικών αρχών της επιστήμης των υπολογιστών μέσω της γλώσσας προγραμματισμού Python", 0 },
                    { 30, "Γραφή και σύνθεση προγραμμάτων σε γλώσσα Python", 0 },
                    { 31, "Eκσφαλμάτωση προγραμμάτων", 0 },
                    { 32, "Ευχέρεια στη εφαρμογή βασικών δομών όπως δομές ελέγχου και επανάληψης", 0 },
                    { 33, "Προσδιορισμός του χρόνου εκτέλεσης των βασικών λειτουργιών μίας δομής δεδομένων", 0 },
                    { 34, "Ικανότητα εφαρμογής των κατάλληλων δομών δεδομένων για την επίλυση υπολογιστικών προβλημάτων.", 0 },
                    { 35, "Εξοικείωση με τη μεθοδολογία της ανακάλυψης, της εξέτασης, της δημιουργίας, της σύνθεσης, της οργάνωσης, της αναθεώρησης και της ανακατασκευής των δομών όπο-τε υφίσταται ανάγκη ή πρόβλημα που χρήζει επίλυσης", 0 },
                    { 36, "Προαγωγή της ελεύθερης, δημιουργικής και επαγωγικής σκέψης", 1 },
                    { 37, "Παράγωγή νέων ερευνητικών ιδεών", 1 },
                    { 38, "Κατανόηση των βασικών αρχών του αντικειμενοστρεφή προγραμματισμό", 0 },
                    { 39, "Ικανότητα σχεδίασης, ανάπτυξης και να υλοποίησης λογισμικού ως λύσεις σε προβλήματα", 0 },
                    { 40, "Ικανότητα εντοπισμού, αξιολόγησης και αξιοποίησης λογισμικού που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης", 0 },
                    { 41, "Αυτόνομη εργασία ", 1 },
                    { 42, "Επίλυση προβλημάτων", 1 },
                    { 43, "Ομαδική Εργασία", 1 },
                    { 44, "Προσαρμογή σε νέες καταστάσεις", 1 },
                    { 45, "Εξοικείωση με βασικές έννοιες και αποτελέσματα των γραφημάτων", 0 },
                    { 46, "Κατανόηση των συνδυαστικών αριθμών όπως Fibonacci, Catalan, Motzkin, Stirling, Bell κ.λπ. καθώς και των εφαρμογών τους", 0 },
                    { 47, "Εξοικείωση με βασικές έννοιες των αυτομάτων, των τυπικών γλωσσών, των αναγωγικών εξισώσεων και των συνήθων και εκθετικών γεννητριών συναρτήσεων", 0 },
                    { 48, "Εξοικείωση με τις βασικές τεχνικές σχεδίασης των σύγχρονων υπολογιστών", 0 },
                    { 49, "Ικανότητα σχεδίασης και ανάπτυξης προγραμμάτων σε συμβολική γλώσσα", 0 },
                    { 50, "Εξοικείωση με εργαλεία προσομοίωσης επεξεργαστών και ικανότητα εκτέλεσης προγραμμάτων συμβολικής γλώσσας", 0 },
                    { 51, "Ικανότητα αξιολόγησης της απόδοσης και σύγκρισης διαφορετικών επεξεργαστών", 0 },
                    { 52, "Ικανότητα χρήσης μεθόδου Simplex", 0 },
                    { 53, "Κατανόηση και χρήση της θεωρίας της Δυϊκότητας", 0 },
                    { 54, "Λύση προβλημάτων με Ανάλυση Ευαισθησίας", 0 },
                    { 55, "Κατανόηση Ακέραιου Γραμμικού Προγραμματισμού", 0 },
                    { 56, "Λύση προβλημάτων Μεταφοράς και Ανάθεσης", 0 },
                    { 57, "Διαχείριση πολύπλοκων προβλημάτων", 1 },
                    { 58, "Κατανόηση αλγορίθμων επίλυσης προβλημάτων", 1 },
                    { 59, "Κατανόηση των βασικών αρχών της C#", 0 },
                    { 60, "Ανάπτυξη εφαρμογών σε ολοκληρωμένα περιβάλλοντα ανάπτυξης (IDEs)", 0 },
                    { 61, "Χρήση του Visual Studio Enterprise Edition", 0 },
                    { 62, "Ανάπτυξη desktop, web, ή/και mobile εφαρμογών", 0 },
                    { 63, "Γρήγορη και αποδοτική παραγωγή κώδικα", 1 },
                    { 64, "Γνώση βασικών εννοιών και αρχών των Λ.Σ.", 0 },
                    { 65, "Θεωρητικές και πρακτικές γνώσεις Unix/Linux", 0 },
                    { 66, "Κατανόηση των εννοιών Διεργασίας και Νήματος", 0 },
                    { 67, "Παράθεση αλγορίθμων χρονοδρομολόγησης της CPU", 0 },
                    { 68, "Προσδιορισμός κύριων τεχνικών διαχείρισης μνήμης", 0 },
                    { 69, "Κατανόηση πολυεπεξεργασίας (multiprocessing)", 0 },
                    { 70, "Ικανότητα διαχείρισης αρχείων και καταλόγων", 1 },
                    { 71, "Προσαρμογή σε νέες καταστάσεις", 1 },
                    { 72, "Προσδιορισμός σύνταξης (BNF, EBNF, συντακτικά διαγράμματα)", 0 },
                    { 73, "Αναγνώριση κανονικών εκφράσεων και συμβολισμών FLEX", 0 },
                    { 74, "Υπολογισμός συνόλων FIRST, FOLLOW, EMPTY, LOOKAHEAD", 0 },
                    { 75, "Αποτίμηση προτεραιοτήτων μεταξύ των συμβόλων μιας δεδομένης γραμματικής", 0 },
                    { 76, "Κατασκευή του πίνακα προτεραιοτήτων μιας γραμματικής", 0 },
                    { 77, "Εργασία σε διεθνές περιβάλλον", 1 },
                    { 78, "Γνώση Θεωριών Πιθανοτήτων και της Στατιστικής", 0 },
                    { 79, "Κατασκευή του πίνακα προτεραιοτήτων μιας γραμματικής", 0 },
                    { 80, "Κατανόηση μεθοδολογιών Περιγραφικής Στατιστικής για την επεξεργασία των στατιστικών δεδομένων", 0 },
                    { 81, "Ικανότητα μετασχηματισμού στατιστικών δεδομένων", 0 },
                    { 82, "Θα προσδιορίζει και θα ταξινομεί τα στάδια Σχεδίασης Δικτύων", 0 },
                    { 83, "Θα διακρίνει το μοντέλο αναφοράς OSI, τη στοίβα πρωτοκόλλων TCP/IP και τη χρήση τους στους Οργανισμούς Τυποποίησης ", 0 },
                    { 84, "Θα είναι σε θέση να προσεγγίζει και να ορίζει το Φυσικό επίπεδο ", 0 },
                    { 85, "Θα διακρίνει το Επίπεδο Συνδέσμου Μετάδοσης Δεδομένων ", 0 },
                    { 86, "Θα έχει εμπεδώσει τα επίπεδα του Ελέγχου πολλαπλής πρόσβασης", 0 },
                    { 87, "Θα υλοποιεί τις εφαρμογές των Δικτύων Μεταγωγής ", 0 },
                    { 88, "Εργασία σε διεπιστημονικό περιβάλλον", 1 },
                    { 89, "Προσαρμογή σε απρόβλεπτες καταστάσεις", 1 },
                    { 90, "Αναγνώριση βασικών εντολών για την ολοκλήρωση των αλγόριθμων", 0 },
                    { 91, "Εφαρμογή αλγοριθμικών τεχνικών για την επίλυση υπολογιστικών προβλημάτων", 0 },
                    { 92, "Διάκριση αλγοριθμικών προβλημάτων σε συστατικά μέρη", 0 },
                    { 93, "Σχεδιασμός και ανάπτυξη πιθανών αποτελεσματικών τεχνικών επίλυσης", 0 },
                    { 94, "Εκτίμηση της ποιότητας λύσης ενός αλγορίθμου.", 0 },
                    { 95, "Αυτόνομη μελέτη και εργασία ", 1 },
                    { 96, "Διαχείριση προβλημάτων", 1 },
                    { 97, "Λήψη αποφάσεων ", 1 },
                    { 98, "Κατανόηση θεμάτων σχετικά με το απαιτούμενο θεωρητικό υπόβαθρο των ΒΔ", 0 },
                    { 99, "Αξιοποίηση θεωρητικής γνώσης για τον σχεδιασμό και την ανάλυση των δεδομένων ενός ΠΣ", 0 },
                    { 100, "Χρήση της γλώσσας SQL με θεωρητικό υπόβαθρο Σχεσιακής Άλγεβρας", 0 },
                    { 101, "Ενσωμάτωση τεχνικών σχεδίασης Σχεσιακών Βάσεων Δεδομένων", 0 },
                    { 102, "Ανάλυση και σύνθεση δεδομένων και πληροφοριών ", 1 },
                    { 103, "Σχεδιασμός έργων Προσαρμογή σε νέες καταστάσεις ", 1 },
                    { 104, "Γνώση βασικών αρχιτεκτονικών και τεχνολογιών ανάπτυξης εφαρμογών στο διαδίκτυο και στον παγκόσμιο ιστό ", 0 },
                    { 105, "Χρήση κατάλληλου προγραμματιστικού περιβάλλοντος για ανάπτυξη εφαρμογών στον πα-γκόσμιο ιστό", 0 },
                    { 106, "Παραγωγή εφαρμογών πελάτη-εξυπηρετητή, ", 0 },
                    { 107, "Γνώση και χρήση αρχιτεκτονικής 3-tier ", 0 },
                    { 108, "Αναζήτηση, ανάλυση και σύνθεση δεδομένων και πληροφοριών", 1 },
                    { 109, "Ταξινόμηση σημάτων σε αναλογικά ή ψηφιακά και συνεχούς ή διακριτού χρόνου ", 0 },
                    { 110, "Κατανόηση του συνεχούς και διακριτού μετασχηματισμού Σχεδιασμός και υλοποίηση περιο-δικής δειγματοληψίας", 0 },
                    { 111, "Γνώση και διαχείριση Αναλογικών και Ψηφιακών Συστημάτων Επικοινωνίας", 0 },
                    { 112, "Χρήση Αναλογικής Διαμόρφωσης : Εύρους, Γωνίας (φάσης, συχνότητας), Παλμών", 0 },
                    { 113, "Γνώση Πολύπλεξης", 0 },
                    { 114, "Διάκριση και ανάπτυξης Παλμοκωδικής διαμόρφωσης", 0 },
                    { 115, "Κατανόηση των αρχών του σχεδιασμού ενός συστήματος διεπαφής", 0 },
                    { 116, "Ικανότητα σχεδίασης, ανάπτυξης και αξιολόγησης συστημάτων διεπαφής με τους χρήστες για οποιαδήποτε εφαρμογή", 0 },
                    { 117, "Ικανότητα αναγνώρισης των διαφόρων εγχειριδίων χρήσης που συνοδεύουν ένα αλλη-λεπιδραστικό λογισμικό", 0 },
                    { 118, "Κατανόηση αλγορίθμων και τεχνικών αναγνώρισης προτύπων, όπως την Μπεϋζιανή θεωρία ταξινόμησης, τα Νευρωνικά δίκτυα και τα Κρυφά Μοντέλα Markov", 0 },
                    { 119, "Ικανότητα αντίληψης του πως συνδυάζονται γνώσεις πιθανοτήτων, στατιστικής, γραμμικής άλγεβρας και βελτιστοποίησης για τη δημιουργία αλγορίθμων αναγνώρισης προτύπων", 0 },
                    { 120, "Ικανότητα ανάλυσης προβλημάτων πραγματικών δεδομένων στα οποία απαιτείται η σχεδίαση/ανάπτυξη/υλοποίηση συστημάτων ταξινόμησης αντικειμένων", 0 },
                    { 121, "Ικανότητα διαχείρισης του φόρτου και της πολυπλοκότητας τέτοιων προβλημάτων πραγματικών δεδομένων σε περιβάλλον ομαδικής εργασίας", 0 },
                    { 122, "Αφαιρετική ικανότητα", 1 },
                    { 123, "Κατανόηση της έννοιας των Πληροφοριακών Συστημάτων (ΠΣ) σε οργανωτική και τεχνική διάσταση", 0 },
                    { 124, "Διάκριση κυριότερων τύπων πληροφοριακών συστημάτων που χρησιμοποιούνται", 0 },
                    { 125, "Γνώση μεθοδολογιών ανάλυσης απαιτήσεων και το μετασχηματισμό σε σχεδίαση συστήματος", 0 },
                    { 126, "Χρήση UML για την κατασκευή Μοντέλων ΠΣ", 0 },
                    { 127, "Γνώση βασικών εννοιών Τεχνητής Νοημοσύνης (ΤΝ) και των Έμπειρων Συστημάτων (ΕΣ)", 0 },
                    { 128, "Ανάπτυξη αλγορίθμων αναζήτησης λύσης με χρήση τεχνητής νοημοσύνης", 0 },
                    { 129, "Έλεγχος Ασάφειας και την Αβεβαιότητας σε συστήματα κανόνων", 0 },
                    { 130, "Γνώση Μηχανικής Μάθησης και Νευρωνικών Δικτύων", 0 },
                    { 131, "Δόμηση εγγράφων ανάλυσης απαιτήσεων λογισμικού", 0 },
                    { 132, "Οργάνωση σχεδίων λογισμικού βασισμένα σε γλώσσες ", 0 },
                    { 133, "Χρήση μοντέλου κύκλου ζωής λογισμικού Rational Unified Process", 0 },
                    { 134, "Κατανόηση της φυσικής οργάνωσης και δομής των Συστημάτων Διαχείρισης Βάσεων Δεδομένων (ΣΔΒΔ), ως κομβικών συστατικών ενός Πληροφοριακού Συστήματος (ΠΣ)", 0 },
                    { 135, "Ικανότητα διαχείρισης θεμάτων που σχετίζονται με τις δοσοληψίες", 0 },
                    { 136, "Ικανότητα αναγνώρισης των χαρακτηριστικών των ειδικών αρχιτεκτονικών ΒΔ ανάλογα με τον τύπο τους", 0 },
                    { 137, "Σχεδιασμός Πληροφοριακών Συστημάτων", 1 },
                    { 138, "Κατανόηση τεχνικών και μεθοδολογιών δημιουργίας, συμπίεσης και δικτύωσης ψηφιακού περιεχομένου, όπως συμπίεσης χωρίς/με απώλειες εικόνας/ήχου/βίντεο/γραφικών (JPEG, JPEG-2000, MPEG-4), ασύρματης δικτύωσης (π.χ., Bluetooth) και ψηφιακής διαχείρισης δικαιωμάτων (π.χ., λύσεις DRM στη μουσική βιομηχανία)", 0 },
                    { 139, "Ικανότητα αντίληψης των συνδυασμών γνώσεων επεξεργασίας σήματος, θεωρίας χρώματος, ψυχοακουστικής, θεωρίας της πληροφορίας, συμπίεσης και δικτύωσης για τη δημιουργία και λειτουργία συστημάτων πολυμέσων", 0 },
                    { 140, "Δυνατότητα ανάπτυξης προχωρημένου λογισμικού Python/MATLAB/GNU Octave για την υλοποίηση αλγορίθμων, τεχνικών και μεθόδων επεξεργασίας πολυμεσικού περιεχομένου", 0 },
                    { 141, "Διαχείριση φόρτου και άγχους", 1 },
                    { 142, "asdas", 0 }
                });

            migrationBuilder.InsertData(
                table: "Tracks",
                columns: new[] { "TrackId", "Name" },
                values: new object[,]
                {
                    { 1, "ΤΛΕΣ" },
                    { 2, "ΠΣΥ" },
                    { 3, "ΔΥΣ" }
                });

            migrationBuilder.InsertData(
                table: "CourseSkills",
                columns: new[] { "CourseId", "SkillId" },
                values: new object[,]
                {
                    { 1, 1 },
                    { 1, 2 },
                    { 1, 3 },
                    { 1, 4 },
                    { 1, 5 },
                    { 1, 6 },
                    { 1, 7 },
                    { 1, 8 },
                    { 1, 9 },
                    { 2, 5 },
                    { 2, 10 },
                    { 2, 11 },
                    { 2, 12 },
                    { 2, 13 },
                    { 2, 14 },
                    { 2, 15 },
                    { 2, 16 },
                    { 3, 17 },
                    { 3, 18 },
                    { 3, 19 },
                    { 3, 20 },
                    { 3, 21 },
                    { 3, 22 },
                    { 3, 23 },
                    { 3, 24 },
                    { 3, 25 },
                    { 3, 26 },
                    { 3, 27 },
                    { 3, 28 },
                    { 4, 6 },
                    { 4, 15 },
                    { 4, 21 },
                    { 4, 23 },
                    { 4, 29 },
                    { 4, 30 },
                    { 4, 31 },
                    { 4, 32 },
                    { 5, 9 },
                    { 5, 21 },
                    { 5, 37 },
                    { 5, 44 },
                    { 5, 45 },
                    { 5, 46 },
                    { 5, 47 },
                    { 6, 7 },
                    { 6, 8 },
                    { 6, 9 },
                    { 6, 33 },
                    { 6, 34 },
                    { 6, 35 },
                    { 6, 36 },
                    { 6, 37 },
                    { 7, 7 },
                    { 7, 8 },
                    { 7, 9 },
                    { 7, 38 },
                    { 7, 39 },
                    { 7, 40 },
                    { 7, 41 },
                    { 7, 43 },
                    { 7, 44 },
                    { 8, 7 },
                    { 8, 9 },
                    { 8, 41 },
                    { 8, 42 },
                    { 8, 43 },
                    { 8, 48 },
                    { 8, 49 },
                    { 8, 50 },
                    { 8, 51 },
                    { 9, 6 },
                    { 9, 41 },
                    { 9, 52 },
                    { 9, 53 },
                    { 9, 54 },
                    { 9, 55 },
                    { 9, 56 },
                    { 9, 57 },
                    { 9, 58 },
                    { 10, 6 },
                    { 10, 41 },
                    { 10, 43 },
                    { 10, 59 },
                    { 10, 60 },
                    { 10, 61 },
                    { 10, 62 },
                    { 10, 63 },
                    { 11, 8 },
                    { 11, 64 },
                    { 11, 65 },
                    { 11, 66 },
                    { 11, 67 },
                    { 11, 68 },
                    { 11, 69 },
                    { 11, 71 },
                    { 11, 72 },
                    { 12, 14 },
                    { 12, 41 },
                    { 12, 43 },
                    { 12, 72 },
                    { 12, 73 },
                    { 12, 74 },
                    { 12, 75 },
                    { 12, 76 },
                    { 12, 77 },
                    { 13, 8 },
                    { 13, 9 },
                    { 13, 41 },
                    { 13, 78 },
                    { 13, 79 },
                    { 13, 80 },
                    { 13, 81 },
                    { 14, 8 },
                    { 14, 23 },
                    { 14, 41 },
                    { 14, 43 },
                    { 14, 77 },
                    { 14, 82 },
                    { 14, 83 },
                    { 14, 84 },
                    { 14, 85 },
                    { 14, 86 },
                    { 14, 87 },
                    { 14, 88 },
                    { 14, 89 },
                    { 15, 90 },
                    { 15, 91 },
                    { 15, 92 },
                    { 15, 93 },
                    { 15, 94 },
                    { 15, 95 },
                    { 15, 96 },
                    { 15, 97 },
                    { 16, 8 },
                    { 16, 41 },
                    { 16, 43 },
                    { 16, 98 },
                    { 16, 99 },
                    { 16, 100 },
                    { 16, 101 },
                    { 16, 102 },
                    { 16, 103 },
                    { 17, 23 },
                    { 17, 43 },
                    { 17, 77 },
                    { 17, 88 },
                    { 17, 104 },
                    { 17, 105 },
                    { 17, 106 },
                    { 17, 107 },
                    { 17, 108 },
                    { 18, 9 },
                    { 18, 23 },
                    { 18, 41 },
                    { 18, 43 },
                    { 18, 77 },
                    { 18, 109 },
                    { 18, 110 },
                    { 18, 111 },
                    { 18, 112 },
                    { 18, 113 },
                    { 18, 114 },
                    { 19, 9 },
                    { 19, 23 },
                    { 19, 42 },
                    { 19, 43 },
                    { 19, 115 },
                    { 19, 116 },
                    { 19, 117 },
                    { 20, 8 },
                    { 20, 9 },
                    { 20, 41 },
                    { 20, 43 },
                    { 20, 118 },
                    { 20, 119 },
                    { 20, 120 },
                    { 20, 121 },
                    { 20, 122 },
                    { 21, 9 },
                    { 21, 23 },
                    { 21, 97 },
                    { 21, 123 },
                    { 21, 124 },
                    { 21, 125 },
                    { 21, 126 },
                    { 22, 41 },
                    { 22, 127 },
                    { 22, 128 },
                    { 22, 129 },
                    { 22, 130 },
                    { 23, 23 },
                    { 23, 24 },
                    { 23, 41 },
                    { 23, 43 },
                    { 23, 108 },
                    { 23, 131 },
                    { 23, 132 },
                    { 23, 133 }
                });

            migrationBuilder.InsertData(
                table: "Courses",
                columns: new[] { "CourseId", "Description", "Name", "Semester", "TrackId" },
                values: new object[,]
                {
                    { 24, "Το μάθημα \"Συστήματα Διαχείρισης Βάσεων Δεδομένων\" εστιάζει στη διδασκαλία βασικών αρχών και τεχνικών για τη διαχείριση βάσεων δεδομένων. Περιλαμβάνει την ανάλυση της δομής των αρχείων και των ευρετηρίων που χρησιμοποιούνται για την αποθήκευση και την ανάκτηση δεδομένων από μια βάση.  Εξετάζει τεχνικές για το σχεδιασμό και τη βελτιστοποίηση ερωτή-σεων στη βάση δεδομένων. Επίσης, στα πλαίσια του μαθήματος. εξετάζονται θέματα που σχε-τίζονται με ειδικές αρχιτεκτονικές βάσεων δεδομένων, όπως οι κατανεμημένες βάσεις, οι παράλληλες βάσεις δεδομένων και οι αρχιτεκτονικές Big Data. Τέλος, περιλαμβάνει πρακτικές ασκήσεις πάνω σε δύο δημοφιλείς συστήματα διαχείρισης βάσεων δεδομένων, το PostgreSQL και το MongoDB.", "ΣΥΣΤΗΜΑΤΑ ΔΙΑΧΕΙΡΙΣΗΣ ΒΑΣΕΩΝ ΔΕΔΟΜΕΝΩΝ", 5, 1 },
                    { 25, "Το μάθημα “Συστήματα Πολυμέσων” ασχολείται με την επιστημονική περιοχή στην οποία συ-ναντώνται και γονιμοποιούνται πληθώρα επιστημονικών πεδίων, όπως η επεξεργασία σήμα-τος, η θεωρία πληροφορίας και οι επικοινωνίες, με στόχο τη Δημιουργία, την Αποθήκευ-ση/Συμπίεση και τη Διανομή του Πολυμεσικού Περιεχομένου. Σκοπός, επομένως, του παρό-ντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις θεμελιώδεις έννοιες της πολυμεσικής επεξεργασίας, τα προβλήματα που καλείται να επιλύσει η σχεδίαση πολυμεσικών συστημάτων και τις σημαντικότερες τεχνικές ψηφιοποίησης, συμπίεσης και διανομής πολυμεσικού περιεχομένου.", "ΣΥΣΤΗΜΑΤΑ ΠΟΛΥΜΕΣΩΝ", 6, 1 },
                    { 26, "Το μάθημα \"Λογικός Προγραμματισμός\" εξετάζει την προτασιακή και κατηγορηματική λογική, αρχές απόφασης και στρατηγικές, μη μονότονη συμπερασματολογία και λογικό προγραμματι-σμό. Επικεντρώνεται στη γλώσσα Prolog και απλές εφαρμογές της, δομές δεδομένων, στρατη-γική αναζήτησης, αναδρομικό και διαζευκτικό προγραμματισμό, λογικό προγραμματισμό περιορισμών, παράλληλο προγραμματισμό, μεταλογικό προγραμματισμό και προχωρημένες εφαρμογές της Prolog.", "ΛΟΓΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ", 5, 1 },
                    { 27, "Το μάθημα \"Βιοπληροφορική\" περιλαμβάνει ενότητες όπως εισαγωγή στη βιοπληροφορική, πρόσβαση σε βιολογικά δεδομένα, στοίχιση αλληλουχιών, χρήση του εργαλείου BLAST, πολ-λαπλή στοίχιση ακολουθιών, μοριακή φυλογένεση, ανάλυση δεδομένων DNA και RNA, γονιδιακή έκφραση και πρωτεϊνική ανάλυση.", "ΕΠΕΞΕΡΓΑΣΙΑ ΦΥΣΙΚΗΣ ΓΛΩΣΣΑΣ", 6, 1 },
                    { 28, "Το μάθημα \"Προηγμένα Θέματα Επικοινωνιών\" επικεντρώνεται στην ανάλυση προηγμένων θεμάτων στον τομέα των επικοινωνιών. Στο μάθημα αυτό, εξετάζονται οι βασικές αρχές της α-σύρματης επικοινωνίας και η φυσική μοντελοποίηση των ασύρματων καναλιών. Επιπλέον, α-ναλύονται θέματα όπως η ασύρματη μετάδοση, η πολλαπλή πρόσβαση και η χωρητικότητα των καναλιών. Οι φοιτητές εξοικειώνονται με τις αρχιτεκτονικές των δικτύων επόμενης γενιάς (NGN) και τις αντίστοιχες εφαρμογές, καθώς και με τις δορυφορικές επικοινωνίες και τη σχεδίαση δορυφορικών ζεύξεων. Τέλος, αναλύονται οι ασύρματες δικτυακές τεχνολογίες πολλαπλών βημάτων και οι ασύρματες δικτυακές αισθητήρες (WSNs). Μέσω των περιεχομένων του μαθή-ματος, οι φοιτητές αποκτούν γνώσεις για τις προηγμένες τεχνολογίες επικοινωνιών και αναπτύσσουν τις απαιτούμενες δεξιότητες για την ανάλυση και σχεδίαση σύγχρονων επικοινωνιακών συστημάτων.", "ΠΡΟΗΓΜΕΝΑ ΘΕΜΑΤΑ ΕΠΙΚΟΙΝΩΝΙΩΝ", 5, 2 },
                    { 29, "Το μάθημα \"Δίκτυα Υψηλών Ταχυτήτων\" αποσκοπεί στην απόκτηση των απαραίτητων γνώσεων για τον σχεδιασμό και την ανάπτυξη δικτύων υψηλών ταχυτήτων, εστιάζοντας στις πιο πρό-σφατες επιστημονικές και τεχνολογικές εξελίξεις του χώρου. Το μάθημα περιλαμβάνει έννοιες και πρωτόκολλα ευρυζωνικών ενσύρματων και ασύρματων δικτύων, δίκτυα μεταγωγής πακέ-των, οπτικά δίκτυα, τεχνολογίες xDSL, IP δίκτυα και υπηρεσίες, ασύρματα τοπικά δίκτυα, α-σύρματα ευρυζωνικά δίκτυα, δορυφορικές επικοινωνίες και Internet of Things (IoT). Η συμβολή του μαθήματος στην κάλυψη επαγγελματικών απαιτήσεων περιλαμβάνει την εισαγωγή σε βα-σικές αρχές και αρχιτεκτονικές δικτύων υψηλών ταχυτήτων, διάφορες τεχνολογίες στον τομέα αυτό, τις έννοιες των τεχνολογιών και προτύπων επικοινωνίας, καθώς και την προσομοίωση και αξιολόγηση δικτύων υψηλών ταχυτήτων.", "ΔΙΚΤΥΑ ΥΨΗΛΩΝ ΤΑΧΥΤΗΤΩΝ", 6, 2 },
                    { 30, "Το μάθημα \"Προηγμένη Αρχιτεκτονική Υπολογιστών\" αποτελεί συνέχεια του μαθήματος κορμού Αρχιτεκτονική Υπολογιστών και εμβαθύνει σε θέματα οργάνωσης και σχεδίασης σύγχρονων επεξεργαστών υψηλής απόδοσης. Επικεντρώνεται στην τεχνική διοχέτευση (pipelining), ιεραρχία μνήμης (cache memory, virtual memory), συνδέσεις μεταξύ επεξεργαστή, μνήμης και συσκευών εισόδου/εξόδου, δυναμικό χρονοπογραμματισμό, πρόβλεψη διακλάδωσης και εικασία, καθώς και πολυνηματικούς και πολυπύρηνους επεξεργαστές.", "ΠΡΟΗΓΜΕΝΗ ΑΡΧΙΤΕΚΤΟΝΙΚΗ ΥΠΟΛΟΓΙΣΤΩΝ", 5, 2 },
                    { 31, "Το μάθημα \"Προηγμένη Αρχιτεκτονική Υπολογιστών\" αποτελεί συνέχεια του μαθήματος κορ-μού \"Αρχιτεκτονική Υπολογιστών\" και έχει ως στόχο την εμβάθυνση των φοιτητών στην οργά-νωση και σχεδίαση σύγχρονων επεξεργαστών υψηλής απόδοσης. Θα δοθεί έμφαση στην τε-χνική της διοχέτευσης (pipelining) για την αύξηση της απόδοσης, στην ιεραρχία μνήμης με τη χρήση κρυφής μνήμης (cache memory) και εικονικής μνήμης (virtual memory), στις συνδέσεις μεταξύ επεξεργαστή, μνήμης και συσκευών εισόδου/εξόδου, στον δυναμικό χρονοπογραμματισμό, την πρόβλεψη διακλάδωσης και εικασία, καθώς και στους πολυνηματικούς και πολυπύρηνους επεξεργαστές.", "ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΣΥΣΤΗΜΑΤΩΝ, ΤΗΛΕΠΙΚΟΙΝΩΝΙΩΝ ΚΑΙ ΥΠΗΡΕΣΙΩΝ", 6, 2 },
                    { 32, "Το μάθημα \"Σχεδίαση Υπολογιστικών Συστημάτων\" εμβαθύνει στη σχεδίαση ψηφιακών συ-στημάτων, αποτελώντας συνέχεια του μαθήματος Λογικής Σχεδίασης Ψηφιακών Συστημάτων. Περιλαμβάνει θέματα όπως μοντελοποίηση κυκλωμάτων, γλώσσες περιγραφής υλικού (VHDL), σχεδίαση συνδυαστικών και ακολουθιακών κυκλωμάτων, μνήμες, μικροπεξεργαστές, προσο-μοίωση κυκλωμάτων, σύνθεση κυκλωμάτων και χρήση FPGAs στη σχεδίαση ψηφιακών κυ-κλωμάτων.", "ΣΧΕΔΙΑΣΗ ΥΠΟΛΟΓΙΣΤΙΚΩΝ ΣΥΣΤΗΜΑΤΩΝ", 6, 2 },
                    { 33, "Το μάθημα \"Κρυπτογραφία\" παρέχει μια εισαγωγή στην κρυπτογραφία και την ιστορική της εξέλιξη. Στα πλαίσια του, γίνεται αναφορά σε μαθηματικές έννοιες, όπως οι ομάδες, τα πεπε-ρασμένα σώματα και οι δακτύλιοι, καθώς και ο αλγόριθμος του Ευκλείδη και η συνάρτηση του Euler. Εξετάζονται αλγόριθμοι ιδιωτικού κλειδιού, όπως η μονοαλφαβητική αντικατάσταση και οι αλγόριθμοι του Καίσαρα, Vigenere και Hill. Επίσης, αναλύονται αλγόριθμοι κρυπτογράφησης όπως οι DES και AES. Το μάθημα περιλαμβάνει, επίσης, ομομορφική κρυπτογραφία, συναρτή-σεις κατακερματισμού, ψηφιακές υπογραφές και εφαρμογές της κρυπτογραφίας και των πρω-τοκόλλων. Τέλος, παρουσιάζονται θέματα υλοποίησης και ανάλυση κρυπτογράφησης, όπως η γραμμική και διαφορική κρυπτανάλυση και οι αλγόριθμοι παραγοντοποίησης.", "ΚΡΥΠΤΟΓΡΑΦΙΑ", 5, 3 },
                    { 34, "Το μάθημα \"Αναλυτική Δεδομένων\" παρέχει γνώσεις σχετικά με τη σχεδίαση και υλοποίηση μεθόδων και τεχνικών Αναλυτικής Δεδομένων, η οποία είναι μια από τις πιο σύγχρονες τάσεις στην περιοχή της Πληροφορικής και της Επιστήμης Δεδομένων (Data Science). Το μάθημα πε-ριλαμβάνει εισαγωγή στην Αναλυτική Δεδομένων και προπαρασκευή δεδομένων (Data Preprocessing) για αναλυτικούς σκοπούς. Εξετάζει επίσης αλγορίθμους και τεχνικές Αναλυτικής Δεδομένων, όπως κατηγοριοποίηση/ταξινόμηση και εξόρυξη συχνών προτύπων. Δίνεται επίσης έμφαση σε ειδικά θέματα, όπως η ανάλυση δεδομένων ήχου/εικόνας και γεωγραφικής πληρο-φορίας. Οι φοιτητές πραγματοποιούν εργαστηριακές ασκήσεις χρησιμοποιώντας δημοφιλείς γλώσσες προγραμματισμού, όπως το R και το Python.", "ΑΝΑΛΥΤΙΚΗ ΔΕΔΟΜΕΝΩΝ", 6, 3 },
                    { 35, "Το μάθημα \"ΣΥΣΤΗΜΑΤΑ ΥΠΟΣΤΗΡΙΞΗΣ ΑΠΟΦΑΣΕΩΝ\" περιλαμβάνει εισαγωγικές έννοιες, εισα-γωγή στα συστήματα υποστήριξης αποφάσεων, αναλυτικά μοντέλα υποστήριξης αποφάσεων με προσανατολισμό στις προτιμήσεις και με προσανατολισμό στα δεδομένα, μεθοδολογίες α-νάπτυξης, μέθοδοι και τεχνικές πολυκριτηριακής ανάλυσης αποφάσεων, καθώς και την περι-βάλλουσα ανάλυση δεδομένων ως μέθοδο αποτίμησης αποδοτικότητας συστημάτων.", "ΣΥΣΤΗΜΑΤΑ ΥΠΟΣΤΗΡΙΞΗΣ ΑΠΟΦΑΣΕΩΝ", 6, 3 },
                    { 36, "Το μάθημα \"ΣΥΣΤΗΜΙΚΗ ΑΝΑΛΥΣΗ\" περιλαμβάνει τις βασικές έννοιες της συστημικής σκέψης στην ανάλυση συστημάτων, τη συστημική προσέγγιση στην ανάλυση συστημάτων, την οργανωτική κυβερνητική συστημάτων, στρατηγικές μεθοδολογίες υπόθεσης, διαμόρφωσης και δοκιμής συστημάτων, μεθοδολογίες σχεδιασμού και ελέγχου συστημάτων και μετασυστημάτων, πολύ-μεθοδολογίες προσέγγισης συστημάτων και πραγματικές εφαρμογές συστημικών μεθοδολογιών στη λειτουργία διεργασιών.", "ΣΥΣΤΗΜΙΚΗ ΑΝΑΛΥΣΗ", 6, 3 },
                    { 37, "Το μάθημα \"ΕΙΚΟΝΙΚΗ ΠΡΑΓΜΑΤΙΚΟΤΗΤΑ\" ασχολείται με τη δομή, τη λειτουργία και την ανάπτυξη εφαρμογών εικονικής πραγματικότητας. Παρουσιάζονται οι κατηγορίες συστημάτων εικονικής πραγ-ματικότητας, οι τρισδιάστατοι κόσμοι γραφικών, τα τρισδιάστατα μοντέλα αντικειμένων και η υφή επιφάνειας αντικειμένων. Επίσης, περιλαμβάνεται η διαχείριση πηγών φωτός, ήχων και κάμερας, καθώς και η δημιουργία animations. Η πλατφόρμα Unity3D αποτελεί το περιβάλλον ανάπτυξης και εξερευνάται η ανάπτυξη εφαρμογών εικονικής πραγματικότητας μέσω αυτής της πλατφόρμας.", "ΕΙΚΟΝΙΚΗ ΠΡΑΓΜΑΤΙΚΟΤΗΤΑ", 7, 1 },
                    { 38, "Το μάθημα \"ΑΝΑΛΥΣΗ ΕΙΚΟΝΑΣ\" επικεντρώνεται στην ανάπτυξη αλγορίθμων που επιτρέπουν σε μηχανές να κατανοούν τον οπτικό κόσμο. Εντάσσεται στο πεδίο της Τεχνητής Νοημοσύνης και έχει ως στόχο να παρουσιάσει τεχνικές και μεθοδολογίες για προβλήματα ανάλυσης εικόνας. Το περιεχόμενο του μαθήματος περιλαμβάνει εισαγωγή στην ανάλυση εικόνας, τελεστές, κατάτμηση εικόνας, με-τρήσεις αντικειμένου εικόνας, ανάλυση έγχρωμης και πολυφασματικής εικόνας, γεωμετρικές προβο-λές, τρισδιάστατη όραση, στερεοσκοπική ανάλυση, ειδικά θέματα ανάλυσης εικόνας όπως σύντηξη αισθητηρίων και βάσεις δεδομένων εικόνων.", "ΑΝΑΛΥΣΗ ΕΙΚΟΝΑΣ", 7, 1 },
                    { 39, "Το μάθημα \"ΣΥΓΧΡΟΝΑ ΘΕΜΑΤΑ ΤΕΧΝΟΛΟΓΙΑΣ ΛΟΓΙΣΜΙΚΟΥ\" επικεντρώνεται στα σύγχρονα ζητήματα της τεχνολογίας λογισμικού. Περιλαμβάνει μοντέλα ανάπτυξης λογισμικού, δομημένη και αντικειμε-νοστρεφή ανάλυση, αρχιτεκτονικό σχεδιασμό και ανάπτυξη εφαρμογών για σύγχρονες κινητές συ-σκευές με ενσωματωμένο λειτουργικό σύστημα. Αναλύονται τα δημοφιλέστερα λειτουργικά συστή-ματα και εργαλεία ανάπτυξης, ενώ επικεντρώνεται κυρίως στην αντικειμενοστρεφή γλώσσα προ-γραμματισμού Java και την ανάπτυξη εφαρμογών για Android συσκευές. Επιπλέον, περιλαμβάνει αισθητήρες, γεοεντοπισμό και προχωρημένες τεχνικές προγραμματισμού όπως ασύγχρονος προγραμματισμός, υπηρεσίες Android, δέκτες εκπομπής και intents. Το μάθημα χρησιμοποιεί το περιβάλλον ανάπτυξης λογισμικού Android Studio.", "ΣΥΓΧΡΟΝΑ ΘΕΜΑΤΑ ΤΕΧΝΟΛΟΓΙΑΣ ΛΟΓΙΣΜΙΚΟΥ", 7, 1 },
                    { 40, "Το μάθημα \"Κατανεμημένα και Πολυεπεξεργαστικά Υπολογιστικά Συστήματα\" εστιάζει σε προηγμένα θέματα από την περιοχή των κατανεμημένων συστημάτων και των πολυεπεξεργαστικών υπολογιστι-κών συστημάτων. Το μάθημα καλύπτει θέματα όπως η επικοινωνία και η αλληλεπίδραση σε κατανεμημένα συστήματα, η οργάνωση εξυπηρετητών και η διαχείριση διεργασιών, ο συγχρονισμός και η ανοχή σφαλμάτων, καθώς και ο προγραμματισμός σε πολυεπεξεργαστές. Επίσης, αναλύονται θέματα όπως οι κατανεμημένες δοσοληψίες, ο προγραμματισμός με CUDA και οι αρχιτεκτονικές GPU. Το μάθημα αποσκοπεί στην ανάπτυξη γνώσεων και δεξιοτήτων που αφορούν τη σχεδίαση και την ανάπτυξη προηγμένων κατανεμημένων και πολυεπεξεργαστικών υπολογιστικών συστημάτων.", "ΚΑΤΑΝΕΜΗΜΕΝΑ ΚΑΙ ΠΟΛΥΕΠΕΞΕΡΓΑΣΤΙΚΑ ΥΠΟΛΟΓΙΣΤΙΚΑ ΣΥΣΤΗΜΑΤΑ", 7, 2 },
                    { 41, "Το μάθημα \"Κινητές και Ασύρματες Επικοινωνίες\" εστιάζει στις αρχές σχεδίασης και λειτουργίας των συστημάτων κινητών και ασύρματων επικοινωνιών. Καλύπτονται θέματα όπως η αρχιτεκτονική κυψελωτών συστημάτων, η κατανομή πόρων και η διαχείριση ραδιοδιαύλων, οι αρχές των συστημάτων 2G, 3G, 4G, 5G, η διαχείριση κινητικότητας, τα ασύρματα τοπικά δίκτυα (WLAN), καθώς και τα ασύρματα προσωπικά δίκτυα και τα δίκτυα μικρής εμβέλειας. Το μάθημα εξετάζει τις πιο πρόσφατες εξελίξεις στον χώρο και προσφέρει μια εκτεταμένη ανάλυση του θέματος.", "ΚΙΝΗΤΕΣ ΚΑΙ ΑΣΥΡΜΑΤΕΣ ΕΠΙΚΟΙΝΩΝΙΕΣ", 7, 2 },
                    { 42, "Το μάθημα \"ΑΣΦΑΛΕΙΑ ΠΛΗΡΟΦΟΡΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ\" επικεντρώνεται στην ασφάλεια της πληρο-φορίας, των συστημάτων και των εφαρμογών κατά την ανάπτυξη και λειτουργία πληροφοριακών συστημάτων. Το μάθημα καλύπτει θέματα όπως εισαγωγικές έννοιες ασφάλειας συστημάτων, συστήματα διαχείρισης ασφάλειας, κρυπτογραφικά συστήματα, υποδομή δημόσιας κλειδαριάς, έλεγχο πρόσβασης και ιδιωτικότητα, ασφάλεια στις τεχνολογίες, ασφαλείς ηλεκτρονικές υπηρεσίες και εισαγωγή στην ασφάλεια δικτύων. Αυτά τα θέματα αποτελούν βασικές πτυχές για την προστασία των πληροφοριακών συστημάτων από απειλές και επιθέσεις.", "ΑΣΦΑΛΕΙΑ ΠΛΗΡΟΦΟΡΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ", 7, 2 },
                    { 43, "Το μάθημα \"Ασφάλεια Δικτύων\" ασχολείται με τη θεωρητική και πρακτική μελέτη θεμάτων ασφά-λειας σε όλα τα επίπεδα δικτύων. Κατά τη διάρκεια του μαθήματος θα γίνει ανάλυση των παρακάτω ενοτήτων: εισαγωγή στην ασφάλεια δικτύων, ασφάλεια δρομολόγησης, σχεδιασμός συστημάτων Firewall, ιδιωτικά εικονικά δίκτυα (VPN), ασφάλεια επιπέδου δικτύου (IPSec) και ασφάλεια επιπέδου συνόδου (SSL/TLS). Μέσα από αυτές τις ενότητες οι φοιτητές θα εξοικειωθούν με τις βασικές αρχές και τεχνικές που αφορούν την ασφάλεια δικτύων.", "ΑΣΦΑΛΕΙΑ ΔΙΚΤΥΩΝ", 8, 2 },
                    { 44, "Το μάθημα \"Ηλεκτρονικό Επιχειρείν και Καινοτομία\" παρουσιάζει το θεωρητικό και πρακτικό πλαίσιο για τη μελέτη και ανάλυση της επιχειρηματικότητας και της καινοτομίας στο σύγχρονο επιχειρηματι-κό περιβάλλον. Το μάθημα επικεντρώνεται στην ανάλυση και την ανάπτυξη εννοιών όπως η εισαγω-γή στο ηλεκτρονικό επιχειρείν και το ηλεκτρονικό εμπόριο, η διαχείριση της ψηφιακής υποδομής, η στρατηγική του ηλεκτρονικού επιχειρείν, η διοίκηση της εφοδιαστικής αλυσίδας, το ψηφιακό μάρκε-τινγκ, η διαχείριση σχέσεων με τους πελάτες και η υλοποίηση υπηρεσιών του ψηφιακού επιχειρείν. Μέσω μελετών περιπτώσεων, όπως η Amazon, το eBay και η Dell, εξετάζονται πρακτικά παραδείγματα καινοτόμων επιχειρηματικών λύσεων που εφαρμόζονται διεθνώς.", "ΗΛΕΚΤΡΟΝΙΚΟ ΕΠΙΧΕΙΡΕΙΝ ΚΑΙ ΚΑΙΝΟΤΟΜΙΑ", 8, 2 },
                    { 45, "Το μάθημα \"Πληροφοριακά Συστήματα στο Διαδίκτυο\" επικεντρώνεται στη μελέτη των πληροφοριακών συστημάτων που λειτουργούν στο διαδίκτυο. Οι θεματικές ενότητες του μαθήματος περιλαμβά-νουν τον δικτυοκεντρικό υπολογισμό, το ηλεκτρονικό εμπόριο και ηλεκτρονικό επιχειρείν, τις νέες τεχνολογίες και εφαρμογές, τα κατανεμημένα συστήματα βασισμένα σε κείμενο, τις βασικές και προηγμένες τεχνικές προγραμματισμού και λειτουργίας στον παγκόσμιο ιστό, καθώς και τον διαδικτυακό προγραμματισμό με Java μέσω Servlets και JSP. Το μάθημα εστιάζει στην κατανόηση και ανάπτυξη πληροφοριακών συστημάτων σε ένα διαδικτυακό περιβάλλον.", "ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ ΣΤΟ ΔΙΑΔΙΚΤΥΟ", 8, 2 },
                    { 47, "Το μάθημα \"ΠΡΟΣΟΜΟΙΩΣΗ ΣΥΣΤΗΜΑΤΩΝ\" επικεντρώνεται στην εισαγωγή, ανάπτυξη και εφαρμογή μοντέλων προσομοίωσης συστημάτων. Παρουσιάζονται θέματα σχεδιασμού μοντέλων, παραγωγής τυχαίων αριθμών και τυχαίων μεταβλητών, στοχαστικών μοντέλων, κατασκευής μοντέλων προσομοίωσης, αντικειμενοστραφούς προσομοίωσης και παρουσίασης λογισμικών προσομοίωσης όπως το VENSIM, AnyLogic και Forio. Επίσης, εξετάζονται οι εφαρμογές της προσομοίωσης σε πληροφοριακά συστήματα και δίκτυα υπολογιστών. Το μάθημα συμβάλλει στην απόκτηση βασικών γνώσεων για την προσομοίωση συστημάτων και την εφαρμογή τους στο πεδίο της πληροφορικής.", "ΠΡΟΣΟΜΟΙΩΣΗ ΣΥΣΤΗΜΑΤΩΝ", 7, 3 },
                    { 48, "Το μάθημα \"Διοικητική Πληροφορική\" εστιάζει στη διοίκηση και οργάνωση έργων πληροφορικής. Στο μάθημα παρουσιάζονται οι βασικές έννοιες και η διάκριση μεταξύ έργων και λειτουργιών. Εξετάζο-νται οι δομές και το πλαίσιο ενός έργου πληροφορικής, καθώς και οι φάσεις και τα βασικά στοιχεία της διοίκησης ενός έργου. Επιπλέον, μελετώνται η ανάλυση μελέτης περιπτώσεων (case studies), οι τεχνικές χρονοδιαγράμματος έργου και οι τεχνικές και μέθοδοι διοίκησης έργων πληροφορικής. Το μάθημα επικεντρώνεται επίσης στους τρόπους εφαρμογής στρατηγικών αρχών στα έργα πληροφορικής.", "ΔΙΟΙΚΗΤΙΚΗ ΠΛΗΡΟΦΟΡΙΚΗ", 8, 3 },
                    { 49, "Το μάθημα \"ΕΚΠΑΙΔΕΥΤΙΚΟ ΛΟΓΙΣΜΙΚΟ\" εισάγει τους φοιτητές στις βοηθούμενες από υπολογιστή ο-δηγίες και τα έξυπνα βοηθητικά συστήματα. Επικεντρώνεται στα μοντέλα χρήστη, με έμφαση στη διάγνωση λαθών, την αναπαράσταση του πεδίου γνώσης διδακτικών εφαρμογών, τον γεννήτορα συμβουλών και το σύστημα διεπαφής με τον μαθητή. Επίσης, παρουσιάζονται πρότυπα έξυπνων διδακτικών συστημάτων σε διάφορους τομείς και πολυμέσα.", "ΕΚΠΑΙΔΕΥΤΙΚΟ ΛΟΓΙΣΜΙΚΟ", 8, 1 },
                    { 50, "Το μάθημα \"Επεξεργασία Σημάτων Φωνής και Ήχου\" περιλαμβάνει εισαγωγή στη ψηφιακή επεξεργα-σία φωνής και ήχου, βασικές έννοιες ψηφιακής επεξεργασίας σήματος, παραγωγή ανθρώπινης ομι-λίας, ανάλυση και εκτίμηση παραμέτρων φωνής και ήχου, ψηφιακή κωδικοποίηση, σύνθεση ομιλίας από κείμενο και ήχους, και αυτοματοποιημένη αναγνώριση ομιλίας και φυσικής γλώσσας.", "ΕΠΕΞΕΡΓΑΣΙΑ ΣΗΜΑΤΩΝ ΦΩΝΗΣ ΚΑΙ ΗΧΟΥ", 8, 1 },
                    { 51, "Το μάθημα \"Ευφυείς Πράκτορες\" επικεντρώνεται στη δομή και λειτουργία ενός ευφυούς πράκτορα, αντιδρασιακούς και βουλητικούς πράκτορες, κύκλο αντιλαμβάνομαι-αποφασίζω-ενεργώ, μοντέλο BDI, εύρεση μονοπατιού, αναπαράσταση ενεργειών, σχεδιασμό ενεργειών βασισμένο σε κίνητρα και την πυραμίδα του Maslow, συναισθηματική υπολογιστική σε ευφυείς πράκτορες, ανάπτυξη συστημάτων ευφυών πρακτόρων, και εφαρμογές στην πλατφόρμα Unity3D.", "ΕΥΦΥΕΙΣ ΠΡΑΚΤΟΡΕΣ", 8, 1 }
                });

            migrationBuilder.InsertData(
                table: "CourseSkills",
                columns: new[] { "CourseId", "SkillId" },
                values: new object[,]
                {
                    { 24, 8 },
                    { 24, 41 },
                    { 24, 43 },
                    { 24, 88 },
                    { 24, 108 },
                    { 24, 134 },
                    { 24, 135 },
                    { 24, 136 },
                    { 24, 137 },
                    { 25, 9 },
                    { 25, 14 },
                    { 25, 41 },
                    { 25, 42 },
                    { 25, 43 },
                    { 25, 138 },
                    { 25, 139 },
                    { 25, 140 },
                    { 25, 141 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 1 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 3 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 4 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 5 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 6 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 7 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 1, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 5 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 10 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 11 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 12 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 13 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 14 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 15 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 2, 16 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 17 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 18 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 19 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 20 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 21 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 22 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 24 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 25 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 26 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 27 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 3, 28 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 6 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 15 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 21 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 29 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 30 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 31 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 4, 32 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 21 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 37 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 44 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 45 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 46 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 5, 47 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 7 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 33 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 34 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 35 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 36 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 6, 37 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 7 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 38 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 39 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 40 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 7, 44 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 7 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 42 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 48 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 49 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 50 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 8, 51 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 6 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 52 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 53 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 54 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 55 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 56 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 57 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 9, 58 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 6 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 59 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 60 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 61 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 62 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 10, 63 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 64 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 65 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 66 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 67 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 68 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 69 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 71 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 11, 72 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 14 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 72 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 73 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 74 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 75 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 76 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 12, 77 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 78 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 79 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 80 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 13, 81 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 77 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 82 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 83 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 84 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 85 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 86 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 87 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 88 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 14, 89 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 90 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 91 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 92 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 93 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 94 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 95 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 96 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 15, 97 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 98 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 99 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 100 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 101 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 102 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 16, 103 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 77 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 88 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 104 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 105 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 106 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 107 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 17, 108 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 77 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 109 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 110 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 111 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 112 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 113 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 18, 114 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 42 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 115 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 116 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 19, 117 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 118 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 119 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 120 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 121 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 20, 122 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 97 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 123 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 124 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 125 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 21, 126 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 22, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 22, 127 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 22, 128 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 22, 129 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 22, 130 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 23 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 24 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 108 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 131 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 132 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 23, 133 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 8 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 88 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 108 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 134 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 135 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 136 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 24, 137 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 9 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 14 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 41 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 42 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 43 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 138 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 139 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 140 });

            migrationBuilder.DeleteData(
                table: "CourseSkills",
                keyColumns: new[] { "CourseId", "SkillId" },
                keyValues: new object[] { 25, 141 });

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "CourseId",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "Skills",
                keyColumn: "SkillId",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "Tracks",
                keyColumn: "TrackId",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Tracks",
                keyColumn: "TrackId",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Tracks",
                keyColumn: "TrackId",
                keyValue: 1);
        }
    }
}
