namespace CareerOrientation.Domain.Common.UserMessages;

public static class InformaticsRecommendationMessages
{
    public static string VeryPoorFit =>
        "Πολύ κακή καταλληλότητα: Φαίνεται πως δείχνεις ελάχιστο έως μηδενικό ενδιαφέρον για την πληροφορική. " +
        "Είναι αρκετά πιθανό πως δεν είναι ο τομέας που ταιριάζει με τις προτιμήσεις ή τις δεξιότητές σου.";
    
    public static string PoorFit =>
        "Κακή καταλληλότητα: Φαίνεται πως δείχνεις μικρό ενδιαφέρον για την πληροφορική. " +
        "Με βάση τις απαντήσεις σου ίσως να μην είναι ένας τομέας που ταιριάζει με τα ενδιαφέροντα ή τις δεξιότητές σου, " +
        "ή ενδεχομένως να χρειάζεσαι περισσότερη έκθεση για να κατανοήσεις καλύτερα τον τομέα.";
    
    public static string ModerateFit =>
        "Μέτρια καταλληλότητα: Φαίνεται πως έχεις κάποιο ενδιαφέρον για την πληροφορική, αλλά αυτό δεν είναι έντονα " +
        "διατυπωμένο. Θα ήταν χρήσιμο να διερευνήσεις περεταίρω τον τομέα αυτό και να συλλέξεις περισσότερες πληροφορίες, " +
        "ώστε να πάρεις μια συγκροτημένη απόφαση.";
    
    public static string GoodFit =>
        "Ικανοποιητική καταλληλότητα: Φαίνεται πως σε ενδιαφέρει η πληροφορική και έχεις πολλές δυνατότητες. " +
        "Είναι πιθανό να σου ταιριάζει  αυτος ο τομέας!";
    
    public static string ExcellentFit =>
        "Εξαιρετική καταλληλόλητα: Φαίνεται πως έχεις μεγάλη κλίση προς την πληροφορική. " +
        "Δείχνεις έντονο ενδιαφέρον και έχεις την προοπτική να διαπρέψεις σε αυτόν τον τομέα!";
}