namespace CareerOrientation.Domain.Common.UserMessages;

public class UniversityOfPiraeusRecommendationMessages
{
    public static string VeryPoorFit =>
        "Πολύ κακή καταλληλότητα: Φαίνεται πως δείχνεις ελάχιστο έως μηδενικό ενδιαφέρον για το πρόγραμμα σπουδών " +
        "του τμήματος πληροφορικής του Πανεπιστημίου Πειραιώς. Είναι αρκετά πιθανό πως δεν είναι το καταλληλότερο τμήμα " +
        "για σένα καθώς δεν φαίνεται να ταιριάζει με τις προτιμήσεις και τις δεξιότητές σου.";
    
    public static string PoorFit =>
        "Κακή καταλληλότητα: Φαίνεται πως δείχνεις μικρό ενδιαφέρον για τα μαθήματα που διδάσκονται στο τμήμα πληροφορικής, " +
        "του Πανεπιστημίου Πειραιώς. Θα ήταν χρήσιμο να συγκρίνεις το πρόγραμμα σπουδών του πανεπιστημίου με άλλα " +
        "πανεπιστήμια, ώστε να πάρεις μία συγκροτημένη απόφαση";
    
    public static string ModerateFit =>
        "Μέτρια καταλληλότητα: Το τμήμα πληροφορικής του Πανεπιστημίου Πειραιώς είναι πιθανό να σου ταιριαζεί. " +
        "Θα ήταν χρήσιμο να διερευνήσεις περεταίρω το πρόγραμμα σπουδών και να συλλέξεις περισσότερες πληροφορίες, " +
        "ώστε να πάρεις μια συγκροτημένη απόφαση.";
    
    public static string GoodFit =>
        "Ικανοποιητική καταλληλότητα: Το τμήμα πληροφορικής του Πανεπιστημίου Πειραιώς αποτελεί καλή επιλογή για σένα" +
        "Φαίνεται πως δείχνεις ενδιαφέρον σε πολλά μαθήματα που διδάσκονται στο τμήμα";
    
    public static string ExcellentFit =>
        "Εξαιρετική καταλληλόλητα: Το τμήμα πληροφορικής του Πανεπιστημίου Πειραιώς αποτελεί εξαιρετική επιλογή για σένα. " +
        "Φαίνεται πως δείχνεις έντονο ενδιαφέρον στα περισσότερα μαθήματα που διδάσκονται στο τμήμα";
}